{
	"description": "List of Anime Girls Holding Programming Books",
	"series": [


		{
			"series_name": "A Certain Magical Index",
			"metadata": "Academy City, Japan, is at the forefront of science. Besides being 30 years ahead of the world technologically, more than three-fourths of this peculiar city's population consists of students developing their psychic abilities as espers in various institutions. Among these students is Touma Kamijou, a high school boy with the lowest psychic rank of zero, but with a mysterious power no scientist can understand: ‘Imagine Breaker,’ which allows him to negate other supernatural abilities. This, however, doesn't affect Kamijou's life in the least as he plays his role as a regular teenager; that is, until he meets the strange Index Librorum Prohibitorum, a young girl who has memorized the entirety of the forbidden grimoires, and now a dangerous organization is hunting Index down. With several magicians looking to harm the girl, Kamijou will defend his new companion at all costs as he discovers a strange new realm of the supernatural.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Uiharu_Kazari_Modern_CPP_Design .jpg"
				},
				{
					"folder": "Java",
					"file1": "Uiharu_Kazari_Thinks_In_Java .jpg"
				}
			]
		},

		{
			"series_name": "A Place Further than the Universe",
			"metadata": "Mari Tamaki is a second-year high school student who wants to make the most out of her youth but is usually too afraid to do so. One day, she meets Shirase Kobuchizawa, a girl who has been saving up to travel to Antarctica, where her mother disappeared three years ago. Joined by two other girls, Hinata Miyake and Yuzuki Shiraishi, they join an expedition headed towards the Antarctic.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Tamaki_Mari_Holding_Eloquent_JavaScript.jpg"
				}
			]
		},

		{
			"series_name": "Asteroid in Love",
			"metadata": "During her childhood, a girl named Mira befriends a boy named Ao and makes a promise with him to discover an asteroid. Upon entering high school, Mira joins the earth sciences club, a merger of the school's astronomy and geology clubs, and reunites with Ao, who she discovers is actually a girl. Alongside their fellow club members, Mira and Ao take part in various astronomical and geological activities in the hopes of one day discovering an asteroid.",
			"locations": [
				{
					"folder": "Algorithms",
					"file1": "Inose_Mai_Teaches_Introduction_to_Algorithms.jpeg",
					"file2": "Konohata_Mira_Reads_Introduction_to_Algorithms.jpeg",
					"file3": "Manaka_Ao_Holds_Introduction_to_Algorithms.jpeg",
					"file4": "Sakurai_Mikage_Holds_Introduction_to_Algorithms.jpeg"
				},
				{
					"folder": "SICP",
					"file1": "Manaka_Ao_Recommends_SICP.png , Miia_Flustered_By_SICP.png"
				}
			]
		},

		{
			"series_name": "Azumanga Daioh",
			"metadata": "Azumanga Daioh chronicles the everyday life in an unnamed Japanese high school of six girls and two of their teachers: child prodigy Chiyo Mihama and her struggle to fit in with girls five years older; reserved Sakaki and her obsession with the cute animals while certain ones seem to hate her; spacey Ayumu ‘Osaka’ Kasuga with a skewed perspective on the world; Koyomi ‘Yomi’ Mizuhara's aggravation at an annoying best friend; Tomo Takino, whose energy is rivaled only by her lack of sense; sporty Kagura and her one-sided athletics rivalry with Sakaki; their homeroom teacher Yukari Tanizaki; and her friend, physical education teacher Minamo 'Nyamo' Kurosawa.",
			"locations": [
				{
					"folder": "ASM",
					"file1": "Tomo_Takino_Assembly.png"
				},
				{
					"folder": "Python",
					"file1": "Chiyo_Mihama_With_Python_Homework.png",
					"file2": "Chiyo_Mihama_With_The_Renegade_Coder_Python_Lab.png"
				}
			]
		},

		{
			"series_name": "Bakemonogatari",
			"metadata": "Koyomi Araragi, a third-year high school student, manages to survive a vampire attack with the help of Meme Oshino, a strange man residing in an abandoned building. Though being saved from vampirism and now a human again, several side effects such as superhuman healing abilities and enhanced vision still remain. Regardless, Araragi tries to live the life of a normal student, with the help of his friend and the class president, Tsubasa Hanekawa. Through several tales involving demons and gods, Bakemonogatari follows Araragi as he attempts to help those who suffer from supernatural maladies.",
			"locations": [
				{
					"folder": "Math",
					"file1": "Oikura_Sodachi_Arithmetic_Algebraic_Geometry.png",
					"file2": "Senjougahara_Hitagi_Ordinary_Differential_Equations.png"
				}
			]
		},

		{
			"series_name": "Beyond The Boundary",
			"metadata": "One day, high school student Akihito Kanbara instinctively goes to save his fellow schoolmate, Mirai Kuriyama, from committing suicide. Following his pleas, Mirai suddenly stabs Akihito with a sword formed out of her own blood and is shocked to discover that Akihito is an immortal ‘half-youmu’—the offspring of a supernatural creature, called a youmu, and a human. After learning that Mirai is a Spirit World Warrior (異界士, Ikaishi)—specialists who protect humans from being affected by youmu—and the last surviving member of her spirit hunting clan, their lives become intertwined as Akihito seeks to help Mirai gain the confidence to kill youmu so that she may stop attempting to kill him as practice.",
			"locations": [
				{
					"folder": "C",
					"file1": "Kuriyama_Mirai_flips_through_The_C_Programming_Language.gif"
				}
			]
		},

		{
			"series_name": "Chrono Crusade",
			"metadata": "The 1920s was a decade of great change and upheaval, with monstrous demons appearing across America. To combat this menace, the holy organization known as the Order of Magdalene was established. The organization's New York branch is home to the young and reckless Sister Rosette Christopher, as well as her partner Chrno. Tasked with the extermination of demonic threats, the renowned team is excellent at their job, despite causing extensive collateral damage on their missions.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Azmaria_Hendric_Holding_SICP.png"
				}
			]
		},

		{
			"series_name": "Clannad",
			"metadata": "Tomoya Okazaki is a delinquent who finds life dull and believes he'll never amount to anything. Along with his friend Youhei Sunohara, he skips school and plans to waste his high school days away. One day while walking to school, Tomoya passes a young girl muttering quietly to herself. Without warning she exclaims ‘Anpan!’ (a popular Japanese food) which catches Tomoya's attention. He soon discovers the girl's name is Nagisa Furukawa and that she exclaims things she likes in order to motivate herself. Nagisa claims they are now friends, but Tomoya walks away, passing the encounter off as nothing. However, Tomoya finds he is noticing Nagisa more and more around school. Eventually he concedes and befriends her. Tomoya learns Nagisa has been held back a year due to a severe illness and that her dream is to revive the school's drama club. Claiming he has nothing better to do, he decides to help her achieve this goal along with the help of four other girls.",
			"locations": [
				{
					"folder": "C",
					"file1": "Fuko_Ibuki_Holding_Up_C.jpg"
				},
				{
					"folder": "Java",
					"file1": "Furukawa_Nagisa_Java_12.png"
				}
			]
		},

		{
			"series_name": "Code Geass",
			"metadata": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence. Lelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the ‘Power of Kings.’ Realizing the vast potential of his newfound ‘power of absolute obedience,’ Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.",
			"locations": [
				{
					"folder": "Java",
					"file1": "Code_Geass_CC_How_To_Program_In_Java.png"
				}
			]
		},

		{
			"series_name": "Darling In the Franxx",
			"metadata": "In the distant future, humanity has been driven to near-extinction by giant beasts known as Klaxosaurs, forcing the surviving humans to take refuge in massive fortress cities called Plantations. Children raised here are trained to pilot giant mechas known as FranXX—the only weapons known to be effective against the Klaxosaurs—in boy-girl pairs. Bred for the sole purpose of piloting these machines, these children know nothing of the outside world and are only able to prove their existence by defending their race.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Ikuno_Holding_Javascript_The_Definitive_Guide.png",
					"file2": "Zero_Two_Holding_Nodejs_8_the_Right_Way.png"
				}
			]
		},

		{
			"series_name": "Death Note",
			"metadata": "A shinigami, as a god of death, can kill any person—provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm. High school student and prodigy Light Yagami stumbles upon the Death Note and—since he deplores the state of the world—tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be.",
			"locations": [
				{
					"folder": "C",
					"file1": "Misa_Amane_C_Programming_Book.png"
				}
			]
		},

		{
			"series_name": "Dirty Pair",
			"metadata": "If you're in big trouble, call the World Welfare Work Association or WWWA. They will send out a team of highly trained capable agents called Trouble Consultants who can solve your problems. But if the team they send you is the Dirty Pair, there will be a lot of collateral damage aside from solving your problems.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Dirty_Pair_Yuri_angry_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Engaged to the Unidentified",
			"metadata": "Kobeni Yonomori is a high school girl who lives with her mother and older sister Benio. Upon turning sixteen, Kobeni is shocked to learn that, due to an arrangement by her late grandfather, she is engaged to a boy named Hakuya Mitsumine who, along with his little sister Mashiro, come to live with Kobeni. As Kobeni spends time adjusting to this new family, she learns there is more to Hakuya and Mashiro than meets the eye. Soon, Kobeni's life becomes a bit more interesting between having a fiancé, a new sister-in-law, and a crazy sister.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Suetsugi_Konoha_hugging_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Etotama",
			"metadata": "The anime's story revolves around Nya-tan, the cat of Chinese astrology who wants to become a member of the Chinese zodiac. Nya-tan is simple and suffers from memory loss, and she tries various idiotic ways to become a member. She meets Takeru Tendo, a high school student who lives alone in Akihabara, and becomes a freeloader at his house. Little by little, she gets closer to her goal.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Etotama_Uri-tan_reading_SICP.png"
				}
			]
		},

		{
			"series_name": "Fate/Grand Order",
			"metadata": "Fate/Grand Order is a turn-based tactical RPG with few visual novel elements. The player takes the role of a 'Master' and commands a group of individuals called ‘Servants’, who are typically historical, literary, and mythological figures from various cultures.",
			"locations": [
				{
					"folder": "Java",
					"file1": "FGO_Artoria_Pendragon_Java_For_Dummies_7.png",
					"file2": "Fate_Java_12_Programming.png"
				}
			]
		},

		{
			"series_name": "Fate/stay Night",
			"metadata": "After a mysterious inferno kills his family, Shirou is saved and adopted by Kiritsugu Emiya, who teaches him the ways of magic and justice. One night, years after Kiritsugu's death, Shirou is cleaning at school, when he finds himself caught in the middle of a deadly encounter between two superhumans known as Servants. During his attempt to escape, the boy is caught by one of the Servants and receives a life-threatening injury. Miraculously, he survives, but the same Servant returns to finish what he started. In desperation, Shirou summons a Servant of his own, a knight named Saber. The two must now participate in the Fifth Holy Grail War, a battle royale of seven Servants and the mages who summoned them, with the grand prize being none other than the omnipotent Holy Grail itself.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Tosaka_Rin_Learning_JS.png"
				},
				{
					"folder": "Ruby",
					"file1": "Saber_Alter_Ruby.png"
				}
			]
		},

		{
			"series_name": "Fire Force",
			"metadata": "Spontaneous Human Combustion: a chaotic phenomenon that has plagued humanity for years, randomly transforming ordinary people into flaming, violent creatures known as Infernals. While Infernals make up the first-generation accounts of Human Combustion, the second and third generations became known as pyrokinetics—people gifted with the ability to manipulate and control their flames while remaining human. To combat the Infernal threat and discover the cause, the Tokyo Armed Forces, Fire Defense Agency, and Holy Church of Sol produced their answer: the Special Fire Force.",
			"locations": [
				{
					"folder": "C",
					"file1": "Maki_Oze_holding_introducao_a_programacao_com_a_linguagem_C.jpg"
				}
			]
		},

		{
			"series_name": "Flying Witch",
			"metadata": "The story is about Makoto, a young witch from Yokohama, who moves to Hirosaki, Aomori to live with relatives as part of her training. What follows is Makoto's daily life as she gets used to her new environment. Her relatives and the new friends she makes there are introduced to the customs and peculiarities of witchcraft.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Kuramoto_Chinatsu_Presenting_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Gabriel DropOut",
			"metadata": "Upon passing a school in heaven, graduating angels are sent down to Earth, where they must learn about humans and guide them towards the correct path in order to become true angels. However, Gabriel White Tenma, the top angel in her class, becomes addicted to video games upon arriving on Earth and turns into a complete slacker as a result. The story follows Gabriel, along with other angels and demons who have descended to Earth, as they attend high school.",
			"locations": [
				{
					"folder": "Architecture",
					"file1": "Vigne_hold_Computer_Architecture_A_Quantitative_Approach.png"
				},
				{
					"folder": "C#",
					"file1": "Chisaki_Tapris_C#.png , Kurumizawa_Satanichia_C#.png"
				},
				{
					"folder": "Java",
					"file1": "Kurumizawa_Satanichia_Intro_To_Java_Programming.png",
					"file2": "Kurumizawa_Satanichia_JavaFx_8_Intro_by_Example.png"
				},
				{
					"folder": "Other",
					"file1": "Kurumizawa_Satanichia_holding_Communist_Manifesto_by_Marx.png"
				},
				{
					"folder": "PHP",
					"file1": "Gabriel_DropOut_Chisaki_Tapris_PHP.png"
				},
				{
					"folder": "SICP",
					"file1": "Chisaki_Tapris_Has_no_clue_SICP.png",
					"file2": "Kurumizawa_Satanichia_Reading_SICP.jpg",
					"file3": "Satania_SICP.jpeg",
					"file4": "Tenma_Gabriel_Yelling_SICP.png"
				},
				{
					"folder": "Uncategorized",
					"file1": "Vigne_holds_Concepts_of_Programming_Languages_by_Sebesta.png"
				}
			]
		},

		{
			"series_name": "Genshin Impact",
			"metadata": "Genshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.",
			"locations": [
				{
					"folder": "HolyC",
					"file1": "Lisa_Minci_Holding_HolyC_book.png"
				}
			]
		},

		{
			"series_name": "Girls und Panzer",
			"metadata": "‘Senshadou’ is a traditional sport using World War II era tanks in elimination-based matches. Widely practiced by women and girls alike, it's advertised as a form of art geared towards making ladies more prominent in culture and appealing to men. Becoming a worldwide phenomenon over time, the influence of senshadou leads to the creation of a world championship which will soon be held in Japan. Miho Nishizumi, who comes from a lineage of well-respected senshadou specialists, is at odds with the sport after a traumatic event led to her retirement and eventually a rift to form between her and her family. To steer clear of the practice as much as possible, she transfers to Ooarai Girls High School where the senshadou program has been abolished. However, with the news of the upcoming championships, the school revives their tankery program, and Miho is pushed into joining.",
			"locations": [
				{
					"folder": "Math",
					"file1": "Yasuraoka_Hanabi_Reading_Lua_Language_Book.png"
				},
				{
					"folder": "Rust",
					"file1": "Takebe_Saori_on_Web_Assembly_With_Rust.png"
				}
			]
		},

		{
			"series_name": "Hanayamata",
			"metadata": "Naru Sekiya is an ordinary 14-year-old middle school girl who likes fairy tales, but is worried about her lack of other interests. She has a chance encounter with a ‘fairy’, a foreign girl practicing dance at night. On a spur of the moment, Naru asks to join her and is introduced to the world of yosakoi dancing. The series' title is a portmanteau (combination) of the first two letters of the girls' first names: Hana, Naru, Yaya, Machi, and Tami.",
			"locations": [
				{
					"folder": "WebGL",
					"file1": "Naru_and_Hana_from_Hanayamata_WebGL_par_la_pratique(french_book).png"
				}
			]
		},

		{
			"series_name": "Hi Score Girl",
			"metadata": "The year is 1991, and arcade video games are the latest craze. Becoming a professional gamer is a far-fetched dream in an industry that has yet to spread its influence. Yet, that is the path sixth-grader Haruo Yaguchi wants to pursue. His aptitude for video games has earned him respect in local arcades and bestowed him with confidence and pride, both of which are shattered when fellow classmate Akira Oono easily defeats him in Street Fighter 2.",
			"locations": [
				{
					"folder": "PHP",
					"file1": "Akira_Oono_Holding_PHP_Programming_Language.jpg"
				}
			]
		},

		{
			"series_name": "Higehiro",
			"metadata": "26-year-old Yoshida is an employee at a major IT company. He meets a high school girl on his way home after drinking. Yoshida's crush had decisively rejected him after he pined for her for five years, and he had decided to drink his sorrow. Sayu, the runaway high school girl he meets, says they could sleep together if he lets her stay with him. Yoshida chides the girl for the suggestion but eventually lets her stay with him.",
			"locations": [
				{
					"folder": "Go",
					"file1": "Sayu_Ogiwara_Holding_GO_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "High School Fleet",
			"metadata": "The story follows a girl named Akeno Misaki who enrolls at Yokosuka Girls' Marine High School in Yokosuka, Kanagawa in order to become one of the highly regarded Blue Mermaids. As Akeno and her classmates set off aboard the fictional Kagerō-class destroyer Harekaze (晴風), an incident with their instructor suddenly leads them to be accused of mutiny. Thus, Akeno must lead her crewmates in sailing the Harekaze as they try to find the truth about what's happening while also avoiding pursuit.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Tateishi_Shima_Reading_SICP.png"
				}
			]
		},

		{
			"series_name": "Himegoto",
			"metadata": "Hime Arikawa is a high school boy whose sizable debt is paid off by the girls of his school's student council. In exchange, he agrees to join the student council and spend the rest of his high school life dressed as a girl.",
			"locations": [
				{
					"folder": "C",
					"file1": "Arikawa_Hime_Holding_C_Programming_Language.png",
					"file2": "Arikawa_Hime_Holding_C_Programming_Language_wp.jpg"
				},
				{
					"folder": "Memes",
					"file1": "Himegoto_Casting_Malloc.png",
					"file2": "Himegoto_Linked_Lists_Beginner.jpg"
				},
				{
					"folder": "Personification",
					"file1": "Arikawa_Hime_dpt.png"
				}
			]
		},

		{
			"series_name": "Himouto! Umaru-chan",
			"metadata": "Umaru Doma is a high school girl who lives with her older brother Taihei. At school, Umaru appears to be the ideal student with good looks, top grades and many talents. However, she transforms into a kid-sized layabout and spends time at home feeding her video game and food addiction, much to Taihei's dismay. Throughout the series, Umaru uses her alternative personality to make friends with others, while at home she throws tantrums about Taihei not buying her things.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Doma_Umaru_Java_Script_The_Good_Parts.png"
				}
			]
		},

		{
			"series_name": "Hitori Bocchi no Marumaru Seikatsu",
			"metadata": "Bocchi Hitori, a girl with social anxiety who has difficulty communicating with others. Before starting middle school, her friend Kai Yawara who will be attending a different school, tells Bocchi she is breaking off their friendship until she can make friends with her entire class at her new school. Thus, Bocchi is left with the task of befriending everyone in her class before graduation.",
			"locations": [
				{
					"folder": "Smalltalk",
					"file1": "Hitori_Bocchi_Smalltalk_80.png"
				}
			]
		},

		{
			"series_name": "How Clumsy you are, Miss Ueno",
			"metadata": "As the head of her middle school's science club, it's only fitting that Ueno is also a brilliant inventor. With devices that can convert any liquid into drinkable water, deodorize the most foul smells, or even generate dark matter to be used as a means of concealment, it seems like nothing is beyond Ueno's capabilities. However, she doesn't invent these devices for the advancement of mankind. Rather, the one force that motivates her is love, the only phenomenon she can't quite figure out. Ueno is head over heels for Tanaka, her nonchalant fellow club member. Yet, because she is too nervous to confess her love and he is too oblivious to notice her affection, her love life is completely stagnant. In Ueno's mind, if she could just expose him to perverted situations, then surely he'd get flustered and fall for her, right? Assisted by her stone-faced classmate and dedicated wingwoman Yamashita, Ueno employs her many inventions on Tanaka in a lewd manner in hopes that he may one day understand how she feels.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Yamashita_reads_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Humanity Has Declined",
			"metadata": "Humanity Has Declined is set in a post-apocalyptic world where the human civilization has regressed and humanity keeps decreasing in numbers. The story follows an unnamed girl who acts as a mediator between humanity and the ‘fairies’ who are small elf-like creatures attracted by sweets and happy things, but also have the habit to cause trouble to her with their powers in their endless search for amusement.",
			"locations": [
				{
					"folder": "Design Patterns",
					"file1": "Watashi_Design_Patterns.jpg"
				}
			]
		},

		{
			"series_name": "Hyouka",
			"metadata": "At the request of his older sister, student Hotaro Oreki joins Kamiyama High School's Classic Literature Club to stop it from being abolished, joined by fellow members Eru Chitanda, Satoshi Fukube and Mayaka Ibara. They begin to solve various mysteries, both to help with their club and at Eru's requests.",
			"locations": [
				{
					"folder": "C",
					"file1": "Chitanda_Eru_Holding_C_Programming_Language.jpg"
				},
				{
					"folder": "Go",
					"file1": "Chitanda_Eru_Holding_GO_Programming_Language.jpg"
				},
				{
					"folder": "Javascript",
					"file1": "Chitanda_Eru_Holding_Programming_Books_With_Deno_Manual_On_The_Top.png"
				}
			]
		},

		{
			"series_name": "In/Spectre",
			"metadata": "While struggling to get past a break-up with his girlfriend, Kuro Sakuragawa was approached by Kotoko Iwanaga, a girl who declared that she was in love with Kuro since she met him two years ago. She then tells him that she is a sort of Goddess of Wisdom where she serves as the intermediary between the real world and the supernatural world. Kuro, of course, doubts her at first but after fighting a yōkai in a library and revealing to each other their true identities (Kuro is actually a monster that has eaten two different yōkai meats giving him the powers of immortality and near-absolute precognition), Kuro agrees to help Kotoko on her various adventures as the peace-keeping Goddess of Wisdom.",
			"locations": [
				{
					"folder": "Rust",
					"file1": "Kotoko_Iwanaga_The_Rust_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Interviews with Monster Girls",
			"metadata": "The story takes place in an age where demi-humans, more casually known as ‘demis’, have slowly started to become accepted into human society. Tetsuo Takahashi is a biology teacher who ends up teaching three such demis, hoping to understand more about them while also managing to catch their attention.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Satou_Sakie_Flustered_Reading_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Is the Order a Rabbit?",
			"metadata": "Kokoa Hoto is a positive and energetic girl who becomes friends with anyone in just three seconds. After moving in with the Kafuu family in order to attend high school away from home, she immediately befriends the shy and precocious granddaughter of Rabbit House cafe's founder, Chino Kafuu, who is often seen with the talking rabbit, Tippy, on her head. With fluffy silliness and caffeinated fun, Gochuumon wa Usagi Desu ka? is a heartwarming comedy about five young waitresses and their amusing adventures in the town they call home.",
			"locations": [
				{
					"folder": "Go",
					"file1": "Kokoa_Hoto_And_Chino_Kafuu_Reading_The_Go_Programming_Language.png"
				},
				{
					"folder": "Python",
					"file1": "Chino_and_Meg_from_GochiUsa_Python.jpg",
					"file2": "Moka_Hoto_Holding_Python_For_Beginners.png"
				},
				{
					"folder": "SICP",
					"file1": "GochiUsa_Is_The_Order_SICP.png"
				}
			]
		},

		{
			"series_name": "Izetta: The Last Witch",
			"metadata": "Set in an alternate Earth on the eve of the Second World War, the story follows Izetta, the last surviving member of a clan of witches that possesses the ability to magically manipulate any object that they touch. Izetta pledges to help protect Princess Finé and the tiny Alpine country of Eylstadt from invasion by the imperialist forces of Germania.",
			"locations": [
				{
					"folder": "Ruby",
					"file1": "Izetta_Introduction_to_Ruby_Programming_for_Future_Professionals.png"
				}
			]
		},

		{
			"series_name": "Joshiraku",
			"metadata": "Joshiraku follows the conversations of five rakugo storyteller girls relating the odd things that happen to them each day. Their comedic and satirical chatting covers all kinds of topics, from pointless observations of everyday life, to politics, manga, and more. Each girl has something new to add to the discussion, and the discourse never ends in the same place it began.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Buratei_Marii_Not_Confident_At_ALL_SICP.png",
					"file2": "Buratei_Marii_Not_Confident_At_ALL_SICP_bg.jpg"
				}
			]
		},

		{
			"series_name": "K-On!",
			"metadata": "A fresh high school year always means much to come, and one of those things is joining a club. Being in a dilemma about which club to join, Yui Hirasawa stumbles upon and applies for the Light Music Club, which she misinterprets to be about playing simple instruments, such as castanets. Unable to play an instrument, she decides to visit to apologize and quit. Meanwhile, the Light Music Club faces disbandment due to a lack of members. This causes the club members to offer anything, from food to slacking off during club time, in order to convince Yui to join. Despite their efforts, Yui insists on leaving due to her lack of musical experience. As a last resort, they play a piece for Yui, which sparks her fiery passion and finally convinces her to join the club. From then onward, it's just plain messing around with bits and pieces of practice. The members of the Light Music Club are ready to make their time together a delightful one!",
			"locations": [
				{
					"folder": "Algorithms",
					"file1": "Mio_Akiyama_Kageyama_Ritsu_reading_Introduction_to_Algorithms.jpg"
				},
				{
					"folder": "C",
					"file1": "Akiyama_Mio_Reading_C_Programming_Language.png",
					"file2": "Ui_Hirasawa_Holding_C_Programming_Language.png"
				},
				{
					"folder": "HoTT",
					"file1": "Yui_Hirasawa_reads_HoTT.png"
				},
				{
					"folder": "Python",
					"file1": "Hirasawa_Yui_Studying_For_interview.png"
				}
			]
		},

		{
			"series_name": "Kaguya-sama: Love Is War",
			"metadata": "In the senior high school division of Shuchiin Academy, the student council president and vice president, Miyuki Shirogane and Kaguya Shinomiya, appear to be a perfect match. Kaguya is the daughter of a wealthy conglomerate family, and Miyuki is the top student at the school and well-known across the prefecture. Although they like each other, they are too proud to confess their love, coming up with many schemes to make the other confess.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Fujiwara_Chika_CPP_for_dummies.jpg",
					"file2": "Kaguya_Shinomiya_Exceptional_C++.png",
					"file3": "Kei_Shirogane_crying_CPP.png"
				},
				{
					"folder": "C",
					"file1": "Ai_Hayasaka_Holding_C_Programming_Language.jpg"
				},
				{
					"folder": "Java",
					"file1": "Hayasaka_Holding_Android_Java.png"
				},
				{
					"folder": "OCami",
					"file1": "Iino_Miko_from_Kaguya-sama_Holding_OCaml_Book.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Fujiwara_Chika_Presents_SICP.png"
				}
			]
		},

		{
			"series_name": "Kantai Collection: KanColle",
			"metadata": "In a world where humanity faces the threat of the abyssal fleet which has taken over the seas, special human girls who don weaponized outfits and possess the spirit of historical naval vessels known as kanmusu (艦娘, literally ‘fleet girls’ or ‘ship girls’) are the only ones capable of countering them. The kanmusu live together at a naval base, where they spend their everyday lives as they begin training for battle.",
			"locations": [
				{
					"folder": "C",
					"file1": "Hibiki_Holding_C_Programming_Language.png"
				},
				{
					"folder": "GDScript",
					"file1": "Hibiki_gdscript.png"
				}
			]
		},

		{
			"series_name": "Katawa Shoujo",
			"metadata": "Katawa Shoujo is a bishoujo-style visual novel set in the fictional Yamaku High School for disabled children, located somewhere in modern Japan. Hisao Nakai, a normal boy living a normal life, has his life turned upside down when a congenital heart defect forces him to move to a new school after a long hospitalization. Despite his difficulties, Hisao is able to find friends—and perhaps love, if he plays his cards right. There are five main paths corresponding to the 5 main female characters, each path following the storyline pertaining to that character.",
			"locations": [
				{
					"folder": "C",
					"file1": "Ikezawa_Hanako_Sitting_Reading_C_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Kemono Friends",
			"metadata": "Japari Park is an untamed paradise where many humanoid animals, known as ‘Friends,’ live their everyday lives in all corners of the natural environmental park. One lazy afternoon in the savannah area, the energetic Serval encounters a peculiar new Friend. Curious, she swiftly takes down the Friend, named Kaban, to try and discover what species she is. To Serval's disappointment, not even Kaban herself knows the answer. The two become friends and set out on a grand adventure through the many habitats, landmarks, and attractions of Japari Park. Their destination is the park library, where they hope to shed some light on Kaban’s identity. Along the way, they meet many other Friends, looking into their lives and helping them out. However, they soon begin to uncover the sinister reality behind the park and their own existence.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Kemono_Friends_Serval_Kaban_Find_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Kin-iro Mosaic",
			"metadata": "Shinobu Omiya is a Japanese high school girl who, five years ago, had a homestay in England with a girl named Alice Cartelet. One day, Shinobu receives a letter from Alice saying she is coming to Japan to live with her. Surely enough, Alice appears and joins Shinobu and her friends Aya Komichi and Yoko Inokuma at her school. She is soon followed by Alice's friend from England, Karen Kujo.",
			"locations": [
				{
					"folder": "Haskell",
					"file1": "Kujou_Karen_Learns_Haskell.png"
				},
				{
					"folder": "SICP",
					"file1": "Kin-iro_Mosaic_Alice_crying_for_bible_SICP.jpg",
					"file2": "Komichi_Aya_Hugging_SICP.jpg",
					"file3": "Kujou_Karen_Does_SICP.png",
					"file4": "Kujou_Karen_Gets_SICP.png",
					"file5": "Kujou_Karen_Likes_SICP.png",
					"file6": "Kujou_Karen_Likes_SICP_.png",
					"file7": "Oomiya_Shinobu_Reading_SICP.gif"
				}
			]
		},

		{
			"series_name": "Kiss x Sis",
			"metadata": "Keita Suminoe is a third-year Japanese middle school student living with his father, stepmother, and older twin stepsisters, Ako and Riko. Since the remarriage of their parents at childhood, the siblings have always been affectionately close and supportive of one another. Nowadays the trio see their opposites in a noticeably less platonic fashion; Ako and Riko frequently flirt and lust after Keita while, much to his stress, he fights the urge to give in to them.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Suminoe_Ako_Reads_SICP.png"
				}
			]
		},

		{
			"series_name": "Kodomo no Jikan",
			"metadata": "3rd grade teacher Aoki Daisuke didn't expect the first class he ever taught to be one of the toughest obstacles of his life. After getting off on the wrong foot with the entire class, a moment of kind-heartedness instantly convinces one of his students, Rin Kokonoe, to make the ill-fated Aoki-sensei her lover. But what exactly are Rin's intentions for wanting to actively seduce Aoki-sensei, and will Aoki-sensei be able to help her to deal with them?",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Kokonoe_Rin_Presenting_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Komi Can’t Communicate",
			"metadata": "On her first day attending the elite Itan Private High School, Shouko Komi immediately receives an overwhelming surge in popularity due to the unprecedented, stoic beauty and refined elegance her classmates perceive her to possess. However, only Hitohito Tadano, an exceedingly average schoolboy who sits next to her, can have the opportunity to discover that, behind her bishōjo appearance, Komi has a severe communication disorder. Subsequently, Tadano resolves to help Komi reach her goal of 100 friends.",
			"locations": [
				{
					"folder": "Algorithms",
					"file1": "Komi_Shouko_holding_Introdution_to_Algorithms.jpg"
				},
				{
					"folder": "Python",
					"file1": "Komi_san_Python.png"
				},
				{
					"folder": "Rust",
					"file1": "Komi_holding_Web_Assembly_with_Rust.png"
				}
			]
		},

		{
			"series_name": "KonoSuba",
			"metadata": "After dying a laughable and pathetic death on his way back from buying a game, high school student and recluse Kazuma Satou finds himself sitting before a beautiful but obnoxious goddess named Aqua. She provides the NEET with two options: continue on to heaven or reincarnate in every gamer's dream—a real fantasy world! Choosing to start a new life, Kazuma is quickly tasked with defeating a Demon King who is terrorizing villages. But before he goes, he can choose one item of any kind to aid him in his quest, and the future hero selects Aqua. But Kazuma has made a grave mistake—Aqua is completely useless! Unfortunately, their troubles don't end here; it turns out that living in such a world is far different from how it plays out in a game. Instead of going on a thrilling adventure, the duo must first work to pay for their living expenses. Indeed, their misfortunes have only just begun!",
			"locations": [
				{
					"folder": "C",
					"file1": "Megumin_Holding_C_Programming_Language.jpg"
				},
				{
					"folder": "Ruby",
					"file1": "Megumin_Reading_Programming_Gengo_Ruby.jpg"
				}
			]
		},

		{
			"series_name": "Laid-back Camp",
			"metadata": "While the perfect getaway for most girls her age might be a fancy vacation with their loved ones, Rin Shima's ideal way of spending her days off is camping alone at the base of Mount Fuji. From pitching her tent to gathering firewood, she has always done everything by herself, and has no plans of leaving her little solitary world. However, what starts off as one of Rin's usual camping sessions somehow ends up as a surprise get-together for two when the lost Nadeshiko Kagamihara is forced to take refuge at her campsite. Originally intending to see the picturesque view of Mount Fuji for herself, Nadeshiko's plans are disrupted when she ends up falling asleep partway to her destination. Alone and with no other choice, she seeks help from the only other person nearby. Despite their hasty introductions, the two girls nevertheless enjoy the chilly night together, eating ramen and conversing while the campfire keeps them warm. And even after Nadeshiko's sister finally picks her up later that night, both girls silently ponder the possibility of another camping trip together.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Kagamihara_Nadeshiko_CPP.png"
				},
				{
					"folder": "C",
					"file1": "Kagamihara_nadeshiko_Reading_C_Programming_Language.png",
					"file2": "Shima_Rin_Motivated_With_C.png"
				},
				{
					"folder": "Lua",
					"file1": "Rin_Shima_Programming_In_Lua.png"
				},
				{
					"folder": "Math",
					"file1": "Shima_Rin_Reading_Diestel_Graph_Theory.png"
				},
				{
					"folder": "Rust",
					"file1": "Inuyama_Aoi_Showing_Off_RUST_Programming.png",
					"file2": "Rin_Shima_The_Rust_Programming_Language.png",
					"file3": "Rin_Shima_The_Rust_Programming_Language_2.png",
					"file4": "Rin_Shima_The_Rust_Programming_Language_3.png"
				},
				{
					"folder": "SICP",
					"file1": "Inuyama_Aoi_Showing_Off_SICP.png",
					"file2": "Shima_Rin_Reading_SICP_2.png",
					"file3": "Shima_Rin_Yuru_SICP.png",
					"file4": "Shima_Rin_reading_SICP.jpg"
				},
				{
					"folder": "Systems",
					"file1": "Shimarin_csapp.png"
				}
			]
		},

		{
			"series_name": "Little Witch Academia",
			"metadata": "For young witches everywhere, the world-renowned witch Shiny Chariot reigns as the most revered and celebrated role model. But as the girls age, so do their opinions of her—now just the mention of Chariot would get a witch labeled a child. However, undeterred in her blind admiration for Chariot, ordinary girl Atsuko Kagari enrolls into Luna Nova Magical Academy, hoping to someday become just as mesmerizing as her idol.",
			"locations": [
				{
					"folder": "Elixir",
					"file1": "Makise_Kurisu_Holding_Programming_Elixir.png"
				},
				{
					"folder": "Math",
					"file1": "Kagari_Atsuko_discrete_maths.jpg"
				}
			]
		},

		{
			"series_name": "Love Live!",
			"metadata": "The ultimate school idol competition featuring the best groups in Japan is called Love Live, and entry into the competition is determined by the popularity of each group. The size of these groups can range anywhere from solo idols to groups with nine or more members. Due to the highly competitive nature of the Love Live competition, some school idols opt not to attempt entry and simply take part in performing at other events. However, participation in the event is very prestigious, and any group that wins the competition is afforded legendary status.",
			"locations": [
				{
					"folder": "D",
					"file1": "Kunikida_Hanamaru_holding_Programming_in_D.jpg"
				},
				{
					"folder": "Haskell",
					"file1": "Nakagawa_Nana_With_Procedural_Haskell.jpg"
				},
				{
					"folder": "HoTT",
					"file1": "Nishikino_Maki_reads_HoTT.png"
				},
				{
					"folder": "Ruby",
					"file1": "Ruby_Kurosawa_Holding_Ruby_Programming_Lang.png"
				},
				{
					"folder": "SICP",
					"file1": "Hanamaru_Kunikida_Holding_SICP.jpg",
					"file2": "Kurosawa_Ruby_Holding_SICP.jpg",
					"file3": "Maki_and_Nico_Love_Live_with_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Love, Chunibyo & Other Delusions",
			"metadata": "Everybody has had that stage in their life where they have thought themselves to be special, different from the masses of ordinary humans. They might go as far as seeing themselves capable of wielding mystical powers, or maybe even believe themselves to have descended from a fantasy realm. This ‘disease’ is known as ‘chuunibyou’ and is often the source of some of the most embarrassing moments of a person's life. For Yuuta Togashi, the scars that his chuunibyou has left behind are still fresh. Having posed as the ‘Dark Flame Master’ during his middle school years, he looks back at those times with extreme embarrassment, so much so that he decides to attend a high school far away where nobody will recognize him. Putting his dark history behind him, he longs to live a normal high school life. Unfortunately, he hasn't escaped his past yet: enter Rikka Takanashi, Yuuta's new classmate and self-declared vessel of the ‘Wicked Eye.’ As this eccentric young girl crashes into Yuuta's life, his dream of an ordinary, chuunibyou-free life quickly crumbles away. In this hilarious and heartwarming story of a boy who just wants to leave his embarrassing memories behind, the delusions of old are far from a thing of the past.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Chuunis_Rikka_Sanae_Studying_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Lucky Star",
			"metadata": "Lucky☆Star follows the daily lives of four cute high school girls—Konata Izumi, the lazy otaku; the Hiiragi twins, Tsukasa and Kagami (sugar and spice, respectively); and the smart and well-mannered Miyuki Takara. As they go about their lives at school and beyond, they develop their eccentric and lively friendship and make humorous observations about the world around them. Be it Japanese tradition, the intricacies of otaku culture, academics, or the correct way of preparing and eating various foods—no subject is safe from their musings.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Kagami_reading_SICP.jpg",
					"file2": "Konata_With_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Magic of Stella",
			"metadata": "Upon enrolling in high school, Tamaki Honda joins a club for making dōjin games known as the SNS Club (short for ‘Some dead fish eyes Not enough sun Shuttle run Club’ (死んだ魚の目日照不足シャトルラン部, Shinda sakana no me Nisshō busoku Shatoru ran-bu). Joined by programmer Shiina, writer Ayame, and composer Kayo, Tamaki begins working as an illustrator for the club's next game.",
			"locations": [
				{
					"folder": "C",
					"file1": "Murakami_Shiina_Holding_Computer_C_Programming_Language.png"
				},
				{
					"folder": "Editors",
					"file1": "Murakami_Shiina_Holding_Computer_Neofetch_Modern_Vim.png"
				},
				{
					"folder": "Memes",
					"file1": "Murakami_Shiina_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Mahoromatic: Automatic Maiden",
			"metadata": "Vesper is a secret agency fighting an army of alien invaders by using super-powerful battle androids. Mahoro is Vesper's most powerful battle android and has won many battles, but she has little operating time left and soon will cease to function. However, if she lays down her arms and conserves her remaining power, the time she has left can be prolonged to just over a year. Mahoro is given an opportunity to live the remaining time she has as a normal human. She chooses to live as a maid for Suguru, a phenomenally messy middle school student who lives by himself after his family passed away.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Mahoro_with_SICP.png"
				}
			]
		},

		{
			"series_name": "Medaka Box",
			"metadata": "Medaka Kurokami is, in the truest sense of the word, perfect. Beautiful, intelligent, and athletic, Medaka's dream is to make others happy. So when she runs for Student Council President of the prestigious Hakoniwa Academy, winning the election with 98% of the votes is only to be expected. The very first thing the boisterous new president does is set up the ‘Medaka Box,’ a suggestion box allowing students to submit any kind of request for assistance. Together with the cynical Zenkichi Hitoyoshi, her childhood friend who has been strong-armed into helping, Medaka fulfills these requests at a ridiculous rate. For every job completed, she adds flowers to the student council room, with the aim of filling the entire school. However, the two are about to find out that helping others may be a lot harder than they think as they begin to uncover a devastating plan centering on the academy and even Medaka herself!",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Saki_Sukinasaki_holding_SICP.PNG"
				}
			]
		},

		{
			"series_name": "Megaman",
			"metadata": "Mega Man, known as Rockman in Japan, is a Japanese science fiction video game franchise created by Capcom, starring a series of robot characters each known by the moniker ‘Mega Man’.",
			"locations": [
				{
					"folder": "Mixed",
					"file1": "Roll-Rockman_C_SICP_Art_Of_Programming.jpg"
				}
			]
		},

		{
			"series_name": "Menhera Shoujo Kurumi-chan",
			"metadata": "My sister is beautiful, cheerful, bright, and homely, but she is actually a mentally unstable girl. This is the story of the younger brother ‘Taichi’ who is swung around by his older sister ‘Nanase Kurumi.’",
			"locations": [
				{
					"folder": "Design Patterns",
					"file1": "Menhera-chan_Agile_Design_Pattern.png",
					"file2": "Menhera-chan_Head_First_Design_Patterns.png"
				},
				{
					"folder": "Haskell",
					"file1": "Menhera-chan_LYAHFGG.png"
				}
			]
		},

		{
			"series_name": "Miss Kobayashi’s Dragon Maid",
			"metadata": "As office worker and programmer Kobayashi gets ready for work, she is greeted by a large dragon right outside her front door. The dragon immediately transforms into a human girl in a maid outfit, and introduces herself as Tohru. It turns out that during a drunken excursion into the mountains the night before, Kobayashi had encountered the dragon, who claimed to have come from another world. Subsequently, Kobayashi had removed a holy sword from Tohru's back, earning her gratitude. With Tohru having no place to stay, Kobayashi offers to let the dragon stay at her home and become her personal maid, to which she agrees, having fallen in love with Kobayashi.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Tohru_Reading_CPP.png"
				},
				{
					"folder": "Compilers",
					"file1": "Tohru_Kanna_Kobayashi_Excited_for_Dragon_book.png",
					"file2": "Tohru_Kanna_Kobayashi_Reading_Dragon_book_(Tohru_cover).png"
				},
				{
					"folder": "Editors",
					"file1": "Kanna_Kamui_Recommends_Emacs.png",
					"file2": "Kobayashi_Holding_GNU_Emacs_Book.png"
				},
				{
					"folder": "Other",
					"file1": "Cosplay_Melon_Pan_Kanna_Reading_SICP.png"
				},
				{
					"folder": "Python",
					"file1": "Drunk_Kobayashi_Python.png"
				},
				{
					"folder": "Rust",
					"file1": "Kanna_Kamui_Finds_RUST_programming.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Kanna_Kamui_Finds_SICP.jpg"
				},
				{
					"folder": "Systems",
					"file1": "Kobayashi_Reading_Computer_Systems.png"
				}
			]
		},

		{
			"series_name": "Miss Monochrome",
			"metadata": "‘Miss Monochrome’ is an original character design from seiyuu Horie Yui. In March 2012, she first used the ‘Miss Monochrome’ character as a 3D virtual singer to sing her songs at her concert ‘Horie Yui wo Meguru Bouken III ~Secret Mission Tour~.’ Later, the character appeared in a range of merchandise as well as in the social network game ‘Girlfriend (Beta).’ According to the setting, Miss Monochrome loves only the monochrome style, dislikes all kinds of color, and always dreams about changing the world into her favorite monochrome color.",
			"locations": [
				{
					"folder": "C",
					"file1": "Miss_Monochrome_Holding_C_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Monobeno: Sonogo no Natsuha no Nanatsu no Natsu",
			"metadata": "Sawai Tooru and his younger sister Natsuha venture back to their rural home town Monobeno – their first visit in six years. Here they reunite with their childhood friend Alice (a girl who labels herself as Tooru's fiancee), and a Yamori Youkai in the form of a small child. After their nostalgic reunion it was not long before the town readied itself for the night of Himemiya Ryuu Shichi Seisai. During the festival, the Monobeno's ancient 'Face Dance' was being performed when Natsuha suddenly collapsed and was rushed home. The next night, Natsuha's body turned into that of an adult's and her lower body bled for the first time. Tooru, fearing for his imouto's life, hastened in his search for a cure...",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Sawai_Natsuha_Smug_SICP.png"
				}
			]
		},

		{
			"series_name": "Monogatari",
			"metadata": "The Monogatari series revolves around Koyomi Araragi, a third-year high school student who has almost restored his humanity after briefly becoming a vampire during spring break. One day, a classmate of his, the reclusive Hitagi Senjōgahara, falls down a flight of stairs at school into Koyomi's arms. To his surprise, he discovers that Hitagi weighs almost nothing, in defiance of physics. Despite being threatened to keep away, Koyomi offers his help and introduces her to Meme Oshino, a strange middle-aged man living in an abandoned cram school who helped reverse his vampirism. Once Koyomi helps solve Hitagi's problem, she decides to become his girlfriend.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Monogatari_Shinobu_Speaking_Javascript.png"
				}
			]
		},

		{
			"series_name": "Monster Musume",
			"metadata": "With his parents abroad, Kimihito Kurusu lived a quiet, unremarkable life alone until monster girls came crowding in! This alternate reality presents cutting-edge Japan, the first country to promote the integration of non-human species into society. After the incompetence of interspecies exchange coordinator Agent Smith leaves Kimihito as the homestay caretaker of a Lamia named Miia, the newly-minted ‘Darling’ quickly attracts girls of various breeds, resulting in an ever-growing harem flush with eroticism and attraction.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Miia_Flustered_By_SICP.png"
				}
			]
		},

		{
			"series_name": "Monthly Girls’ Nozaki-kun",
			"metadata": "High school student Chiyo Sakura has a crush on schoolmate Umetarou Nozaki. When she confesses her love to him, he mistakes her for a fan and gives her an autograph. When she says she wants to be with him, he invites her to his house and has her help on some drawings. Sakura discovers that Nozaki is actually a renowned shōjo manga artist working under the pen name Sakiko Yumeno. She agrees to be his assistant in order to get closer to him. As they work on his manga Let's Fall in Love (恋しよっ, Koi Shiyo, a.k.a. Let's Have a Romance), they encounter other schoolmates, who assist them and serve as inspirations for the story.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Sakura_Chiyo_Flustered_Hugging_SICP.jpg"
				}
			]
		},

		{
			"series_name": "My Hero Academia",
			"metadata": "Izuku Midoriya, a boy who wishes to become a hero like his idol, However, lacking a quirk makes him an easy target for bullying from his peers and his childhood friend. Eventually, the physical and emotional abuse escalates him to become emotionless. However, he gets accepted to U.A. High School after saving Katsuki from a villain.",
			"locations": [
				{
					"folder": "Go",
					"file1": "Yaoyorozu_Momo_Holding_Go_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Nekopara",
			"metadata": "The siblings Kashou and Shigure Minazuki enjoy the company of six catgirls. Chocola and Vanilla assist Kashou in his job as a baker at the patisserie La Soleil, while the others—Coconut, Azuki, Cinnamon, and Maple—accompany Shigure in her daily life back at their home. One afternoon, when Chocola goes out for an errand, she notices a green-haired kitten alone by herself at a park and decides to bring her back to the patisserie. Soon after, the Minazuki household adopts her and gives her a name: Cacao. With a new member in their family, the members of the Minazuki household continue their everyday lives—bound to become livelier than ever.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Maple_Reading_SICP.png"
				}
			]
		},

		{
			"series_name": "Neon Genesis Evangelion",
			"metadata": "Evangelion follows Shinji Ikari, a fourteen-year-old boy, who is summoned to Tokyo-3 by his father Gendo Ikari to pilot Evangelion Unit-01 on the eve of an Angel attack. Treated as a tool by his father, Shinji joins Rei Ayanami and Asuka Langley Soryu as mankind's last hope against the mysterious beings known as the ‘Angels’. As the series progresses, the true natures of NERV, the Evangelions, and the Angels are revealed.",
			"locations": [
				{
					"folder": "C",
					"file1": "Smug_Asuka_Holding_The_C_Programming_Language.png"
				},
				{
					"folder": "Kotlin",
					"file1": "Maya_Enjoys_Kotlin.png",
					"file2": "Misato_and_Shinji_Discovering_Kotlin.jpg"
				}
			]
		},

		{
			"series_name": "New Game!",
			"metadata": "Having been inspired by the character designs of a particular video game when she was younger, Aoba Suzukaze, a high school graduate, begins working as a character designer for the game's developer, Eagle Jump. As she works on modelling and designing characters for games in development, she becomes acquainted with her colleagues in the character design department, as well as those from within the company.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Sakura_Nene_CPP.jpg",
					"file2": "Sakura_Nene_CPP_Covered.jpg",
					"file3": "Sakura_Nene_CPP_Fullface.png"
				},
				{
					"folder": "C",
					"file1": "Sakura_Nene_Holding_C_Programming_Language_Book.jpg"
				},
				{
					"folder": "Cobol",
					"file1": "Yagami_Kou_Presenting_Structured_COBOL.png"
				},
				{
					"folder": "Nim",
					"file1": "Suzukaze_Aoba_Nim_In_Action.png"
				},
				{
					"folder": "Rust",
					"file1": "Nene_Sakura_Rust.png"
				},
				{
					"folder": "SICP",
					"file1": "Sakura_Nene_Prefers_SICP.jpg",
					"file2": "Suzukaze_Aoba_holding_SICP.png",
					"file3": "Yagami_Kou_Starts_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Nichijou",
			"metadata": "Nichijou follows the everyday lives of various people in the town of Tokisadame, centering on the energetic Yūko Aioi, the bright and cheerful Mio Naganohara, the quiet and deadpan Mai Minakami, the anxious android Nano Shinonome, her young creator the Professor, and a talking cat named Sakamoto, along with an ensemble cast of characters. Random and/or outlandish events regularly occur throughout the series, mainly through the mundane situations each character goes through.",
			"locations": [
				{
					"folder": "Java",
					"file1": "Yuuko_Aioi_Holding_Fundamentals_Of_Java_Programming.png"
				},
				{
					"folder": "SICP",
					"file1": "Professor_Shinonome_Finds_SICP.jpg",
					"file2": "Professor_Shinonome_Sleeps_With_SICP.gif"
				}
			]
		},

		{
			"series_name": "No Game No Life",
			"metadata": "Sora and Shiro are two hikikomori step-siblings who are known in the online gaming world as Blank, an undefeated group of gamers. One day, they are challenged to a game of chess by Tet, a god from another reality. The two are victorious and are offered to live in a world that centers around games. They accept, believing it to be a joke, and are summoned to a reality known as Disboard. There, a spell known as the Ten Pledges prevents the citizens of Disboard from inflicting harm on one another, forcing them to resolve their differences by gambling with games whose rules and rewards are magically enforced. In-game, rule enforcement only occurs when the method of cheating is acknowledged and outed by the opponent, allowing players to cheat through discrete methods.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Shiro_Holding_Stroustrup_4th_Edition.png"
				}
			]
		},

		{
			"series_name": "Non Non Biyori",
			"metadata": "The story takes place in the countryside small town village of Asahigaoka, a place lacking many of the conveniences that people from the city are accustomed to. The nearest stores are a few miles away and one of the local schools consists of only five students, each of whom is in a different grade of elementary or middle school. Hotaru Ichijo, a fifth grader from Tokyo, transfers into Asahigaoka Branch School and adjusts to countryside life with her new friends.",
			"locations": [
				{
					"folder": "C",
					"file1": "Renge_Reading_C_Programming_Language.jpg"
				},
				{
					"folder": "Haskell",
					"file1": "Miyauchi_Renge_Holding_Haskell_Programming.png"
				}
			]
		},

		{
			"series_name": "Nyanko Days",
			"metadata": "Average high school student Yuuko Konagai tends to be rather shy and socially awkward. Due to this, besides earning rather mediocre grades, she barely has friends inside her class. However, after a monotonous day at school, she returns to her long-awaited haven—home with her cats Maa, Shi, and Ro! With their unique personalities, the three possess bodies similar to those of humans, retaining the ability to speak and communicate. Every day, the adorable bunch awaits their owner's return to shower her with much-needed companionship.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Maa_nyanko_days_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Nyaruko: Crawling with Love",
			"metadata": "Mahiro Yasaka is just an ordinary high school student, until one day he is suddenly attacked by a dangerous monster. Just when everything seems to be lost, he is saved by a silver-haired girl named Nyaruko, who claims to be the shape-shifting deity Nyarlathotep from horror author H. P. Lovecraft's Cthulhu Mythos, sent by the Space Defense Agency to Earth. She explains to Mahiro that the creature chasing him was an alien called Nightgaunt, who had planned on abducting and selling him as a slave. After rescuing him from the alien, the Lovecraftian deity falls madly in love with Mahiro and forces herself into his household, much to his chagrin. Moreover, they are soon joined by two others from the fictional universe: Cthuko, a girl obsessed with Nyaruko, and Hasuta, a young boy easily mistaken for a beautiful female. Together, the three eccentric aliens protect Mahiro from the various extraterrestrial dangers that threaten both his and Earth's well-being, all the while making his life a living hell.",
			"locations": [
				{
					"folder": "Mixed",
					"file1": "Nyaruko_Holding_React_And_Git_Essentials.jpg"
				}
			]
		},

		{
			"series_name": "Ooya-san wa Shishunki!",
			"metadata": "Maeda has just moved into his new apartment to live by himself. While unpacking, a cute middle school student named Chie Satonaka suddenly appears in his room. She introduces herself as his new landlord, which pleasantly surprises him as he has never seen a landlord so young. His excitement is boosted further when the gorgeous Reiko Shirai, who lives directly next to him, also introduces herself as his new neighbor.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Satonaka_Chie_Ooya-san_wa_Shishunki_Glancing_SICP.png"
				}
			]
		},

		{
			"series_name": "Oreimo",
			"metadata": "The diehard otaku Kirino Kousaka has returned and settled back into life in Japan with her friends and family. Despite what her older brother Kyousuke has previously done for her, Kirino continues to give him the cold shoulder, much to his frustration. He is worried that his persuasion for Kirino to drop her track and field training in America and return home may have severely strained his relationship with her. On top of that, Kyousuke now also has to decode a bold and cryptic message from Ruri 'Kuroneko' Gokou, his junior at school as well as Kirino's friend.",
			"locations": [
				{
					"folder": "C",
					"file1": "Kuroneko_Holding_Fake_C_Book.png"
				},
				{
					"folder": "Elixir",
					"file1": "Ruri_Gokou_Holding_Elixir_Tutorial.png"
				},
				{
					"folder": "Python",
					"file1": "Kirino_Happy_Python.png"
				},
				{
					"folder": "SICP",
					"file1": "Gokou_Ruri_Points_At_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Overlord",
			"metadata": "The final hour of the popular virtual reality game Yggdrasil has come. However, Momonga, a powerful wizard and master of the dark guild Ainz Ooal Gown, decides to spend his last few moments in the game as the servers begin to shut down. To his surprise, despite the clock having struck midnight, Momonga is still fully conscious as his character and, moreover, the non-player characters appear to have developed personalities of their own! Confronted with this abnormal situation, Momonga commands his loyal servants to help him investigate and take control of this new world, with the hopes of figuring out what has caused this development and if there may be others in the same predicament.",
			"locations": [
				{
					"folder": "Typescript",
					"file1": "Shalltear_Bloodfallen_Holding_Effective_Typescript.png"
				}
			]
		},

		{
			"series_name": "Pandora in the Crimson Shell: Ghost Urn",
			"metadata": "Onboard a cruise ship heading to the scenic Cenancle Island, the full-body cyborg Nene Nanakorobi, a bubbly young girl who dreams of world peace, meets inventor Uzal Delilah. The two become fast friends along with Uzal's pet cyborg Clarion, a cat-like combat android. Soon after parting ways, a terrorist attack on the island threatens to shatter the pair's new friendship. In a bid to save her new friend, Uzal gives Nene the ability to use the Pandora Device found in Clarion's body before seemingly dying. With this power, Nene can temporarily master abilities and skills never seen before in the advancing world.",
			"locations": [
				{
					"folder": "Rust",
					"file1": "Koukaku_no_Pandora_Rust_Programming.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Koukaku_no_Pandora_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Plastic Memories",
			"metadata": "Eighteen-year-old Tsukasa Mizugaki has failed his college entrance exams, but after pulling some strings, he manages to land a job at the Sion Artificial Intelligence Corporation. SAI Corp is responsible for the creation of ‘Giftias’—highly advanced androids which are almost indiscernible from normal humans. However, unlike humans, Giftias have a maximum lifespan of 81,920 hours, or around nine years and four months. Terminal Service One, the station Tsukasa was assigned to, is responsible for collecting Giftias that have met their expiration date, before they lose their memories and become hostile.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Isla_Angry_Holding_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Please Teacher!",
			"metadata": "Please Teacher! is a story mainly revolving around a tight-knit group of friends in high school and how they cope with several life-changing events that are never too far off from intimate relationships. The main character is a boy named Kei Kusanagi who suffers from a very rare disease which causes a comatose state referred to as a ‘standstill’ whenever he is under severe emotional distress.",
			"locations": [
				{
					"folder": "C",
					"file1": "Karen_C_Programming_Language.png"
				},
				{
					"folder": "Perl",
					"file1": "Mizuho_Programming_Perl.png"
				}
			]
		},

		{
			"series_name": "Pop’n Music",
			"metadata": "Pop'n Music (ポップンミュージック, Poppun Myūjikku), commonly abbreviated as Pop'n, PM or PNM and stylized as pop'n music, is a music video game series in the Bemani series made by Konami. The games are known for their bright colors, upbeat songs, and cute cartoon character graphics.",
			"locations": [
				{
					"folder": "Other",
					"file1": "Hakurei_Reimu_PC98_holding_PC9801_Programming_Bible.png"
				},
				{
					"folder": "Systems",
					"file1": "Hakurei_Reimu_reading_SerenityOS_Programming.png"
				}
			]
		},

		{
			"series_name": "Pretty Cure",
			"metadata": "Futari wa Precure protagonists Nagisa Misumi and Honoka Yukishiro are about as different as two people can get. Nagisa is the captain of the lacrosse team, a lover of food, and a hater of homework. Honoka loves to learn, working with the science club and earning the nickname ‘The Queen of Knowledge’ from her fellow classmates. Their lives are unconnected until one day, when a mysterious star shower unites them.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Laura_La_Mer_Enjoying_SICP.png",
					"file2": "Yukimura_Aoi_Reading_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Rascal Does Not Dream of Bunny Girl Senpai",
			"metadata": "Sakuta Azusagawa's life takes a turn for the unexpected when he meets teenage actress Mai Sakurajima, dressed as a bunny girl, wandering through a library and not being noticed by anyone else there. Mai is intrigued that Sakuta is the only one who can see her, as other people are unable to see her, even when she is dressing normally or attempting to stay away from celebrity life. Calling this phenomenon ‘Adolescence Syndrome’, Sakuta decides to solve this mystery, while continuing to get closer to Mai and meeting other girls who suffer from ‘Adolescence Syndrome’ as well.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Sakurajima_Mai_Holding_The_C++_Programming_Language.jpg"
				},
				{
					"folder": "C",
					"file1": "Mai_Sakurajima_Holding_C_Programming_Language.png"
				},
				{
					"folder": "Elixir",
					"file1": "Sakurajima_Mai_holding_Elixir_in_Action.png"
				},
				{
					"folder": "HolyC",
					"file1": "Sakurajima_Mai_Holding_The_HolyC_Programming_Language.jpg"
				},
				{
					"folder": "Systems",
					"file1": "Sakurajima_Mai_holding_SerenityOS_Programming.png"
				}
			]
		},

		{
			"series_name": "Re:Creators",
			"metadata": "Sōta Mizushino is a young high school student and anime fan who dreams of writing his own light novel. While watching the anime adaptation of the mecha light novel Elemental Symphony of Vogelchevalier to look for inspiration, the tablet computer he is watching it on sputters and drags him into the anime's world, where he witnesses a battle between the anime's character Selesia and a mysterious girl wearing a military uniform. After returning with Selesia, Sōta discovers that other characters from different stories and forms of media were also brought to the real world, with some of them aligned with the military uniform princess, who promised them the ways to end the strife in their worlds and a way back home, unaware of her true intentions. To stop her, Sōta and Selesia agree to find the other characters and bring them home; lest the military uniform princess will bring untold destruction to every world that exists.",
			"locations": [
				{
					"folder": "C",
					"file1": "Meteora_Österreich_Holding_C_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Re:Zero",
			"metadata": "Subaru Natsuki is an ordinary high school student who is lost in an alternate world, where he is rescued by a beautiful, silver-haired girl. He stays near her to return the favor, but the destiny she is burdened with is more than Subaru can imagine. Enemies attack one by one, and both of them are killed. He then finds out he has the power to rewind death, back to the time he first came to this world. But only he remembers what has happened since.",
			"locations": [
				{
					"folder": "HoTT",
					"file1": "Beatrice_Holding_HoTT.png"
				},
				{
					"folder": "Javascript",
					"file1": "Felix_Argyle_Scared_By_JavaScript_The_Good_Parts.png",
					"file2": "Ram_Holding_JavaScript_The_Good_Parts.png"
				},
				{
					"folder": "Typescript",
					"file1": "Beako_Reading_The_TypeScript_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Rozen Maiden",
			"metadata": "Traumatized by school, Jun Sakurada spends his days at home as a shut-in, purchasing things online, only to send them back before the free trial period ends. So when a note appears on his desk, asking whether or not he would wind something, he assumes it was something he ordered and carelessly circles ‘yes,’ changing his life forever. A box arrives with a wind up doll inside, but this is no ordinary toy: after Jun winds her up, she begins walking and talking as if a normal person. With a haughty attitude, she introduces herself as Shinku, the fifth doll in the Rozen Maiden collection, a group of special dolls made by the legendary dollmaker Rozen. These sisters must battle each other in a competition called the Alice Game with the help of a human to ensure victory. The winner becomes Alice, a real girl who is worthy of meeting their creator.",
			"locations": [
				{
					"folder": "Rust",
					"file1": "Suigintou_Smug_Rust.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Suigintou_Smug_SICP.jpg"
				}
			]
		},

		{
			"series_name": "SE System Engineer",
			"metadata": "On his daily morning commute to campus, computer science major Shirou Oka regularly sees the same high school girl seated in front of him, reading the latest programming books. But, Oka could never muster the courage to speak to the girl—until his final day as a university student. Unfortunately, his last chance results in him grabbing and spilling the contents of her book bag all over the station platform. Flustered, Oka helps her retrieve the scattered belongings, only to pick up an object that looks exactly like a sex sleeve, causing the girl to quickly hide it and run away from him. Disheartened by the mishap, Oka vows to forget about the girl and devote everything to his budding career. He lands a job at Peach System Co. as a system engineer, but soon finds out that the position involves more than just programming. To make matters worse, the girl he saw on his commutes turns out to be the company's president! Momoka Takashima is the 17-year-old genius programmer often praised as the ‘Steve Jobs of the sex sleeve industry.’ With her innovative ideas, Momoka leads the small business of coding, prototyping, and testing these products to create the perfect ‘smart hole.’",
			"locations": [
				{
					"folder": "Uncategorized",
					"file1": "Takashima_Momoka_reading_Hardcore_Programming.png"
				}
			]
		},

		{
			"series_name": "Sakura Trick",
			"metadata": "Haruka Takayama and Yū Sonoda were inseparable during middle school, but upon entering high school, they end up being seated on opposite sides of the classroom. Having to spend time with new friends, the two decide to make their relationship special by kissing each other in secret.",
			"locations": [
				{
					"folder": "Quantum Computing",
					"file1": "Minami_Shizuku_Noda_Kotone_from_Sakura_Trick_Quantum_Field_Theory.png"
				}
			]
		},

		{
			"series_name": "Scum's Wish",
			"metadata": "High school student Hanabi Yasuraoka has been in love with Narumi Kanai, her older childhood friend who is now her homeroom teacher. But from the look in Narumi's eyes when he sees the new music teacher Akane Minagawa, Hanabi realizes that he is in love with Akane and not her. Hanabi meets Mugi Awaya, another student who is in love with Akane, who was his tutor when he was in middle school. Hanabi and Mugi make a pact and begin a fake relationship to satisfy each other's loneliness from their respective unrequited loves, both sexually and emotionally. They agree to not fall in love with each other and end the relationship if their love is returned from the people they are in love with.",
			"locations": [
				{
					"folder": "C#",
					"file1": "Yasuraoka_Hanabi_Reading_CSharp_Language_Book.png.png"
				},
				{
					"folder": "Lua",
					"file1": "Yasuraoka_Hanabi_Reading_Lua_Language_Book.png"
				}
			]
		},

		{
			"series_name": "Serial Experiments Lain",
			"metadata": "Lain Iwakura, an awkward and introverted fourteen-year-old, is one of the many girls from her school to receive a disturbing email from her classmate Chisa Yomoda—the very same Chisa who recently committed suicide. Lain has neither the desire nor the experience to handle even basic technology; yet, when the technophobe opens the email, it leads her straight into the Wired, a virtual world of communication networks similar to what we know as the internet. Lain's life is turned upside down as she begins to encounter cryptic mysteries one after another. Strange men called the Men in Black begin to appear wherever she goes, asking her questions and somehow knowing more about her than even she herself knows. With the boundaries between reality and cyberspace rapidly blurring, Lain is plunged into more surreal and bizarre events where identity, consciousness, and perception are concepts that take on new meanings.",
			"locations": [
				{
					"folder": "Go",
					"file1": "Lain_Reading_The_Go_Programming_Lanquage.png"
				},
				{
					"folder": "Other",
					"file1": "Lain_holding_Hacker_Heaven_behind_her_back.jpg"
				},
				{
					"folder": "Perl",
					"file1": "Iwakura_Lain_Programming_Perl.png"
				},
				{
					"folder": "Rust",
					"file1": "Iwakura_Lain_Rust_programming.png"
				},
				{
					"folder": "SICP",
					"file1": "Iwakura_Lain_SICP.png",
					"file2": "Lain_Holding_SICP_Behind_Her_Back.png"
				}
			]
		},

		{
			"series_name": "Shadow House",
			"metadata": "In a grandiose and dark mansion, the denizens of the Shadow House live, attended by their Living Doll partners who endlessly clean the soot their masters emit. Emilico, a young and cheerful Living Doll, is delighted to start serving her mistress Kate. As the two grow closer and are slowly exposed to various events within the House, they start to discover a number of dark secrets.",
			"locations": [
				{
					"folder": "Python",
					"file1": "Emilico_From_ShadowsHouse_Python.jpg"
				}
			]
		},

		{
			"series_name": "Sound! Euphonium",
			"metadata": "The Kitauji High School Concert Band Club had at one time participated in national tournaments and was a championship-caliber school, but after the club's adviser changed, they had not been able to even participate in the qualifying tournament. However, thanks to the newly appointed adviser's strict instruction, the students are steadily improving and building up their strength. As they fight over who plays solos, some students give priority to studying and quit club activities. Finally, the long wished-for day of the competition arrives, and the club wins the qualifying tournament.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Oumae_Kumiko_Reading_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Squid Girl",
			"metadata": "Vowing to take over the world as revenge for polluting the ocean, Squid Girl attempts to make her base of operations the Lemon Beach House (alt. Lemon Beach Shack), a small beachside restaurant run by the Aizawa siblings. However, when she accidentally breaks a hole in their wall trying to demonstrate her power by trying to swat a mosquito, she is forced to work as a waitress to pay off the damages. Thus, Squid Girl begins her life on the surface, learning new things and encountering many curious visitors.",
			"locations": [
				{
					"folder": "Math",
					"file1": "Squid_Girl_Ikamusume_holds_The_Theory_of_Algebraic_Number_Fields_by_Hilbert.png"
				},
				{
					"folder": "Rust",
					"file1": "Squid_Girl_Ikamusume_recommends_Rust.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Squid_Girl_Ikamusume_recommends_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Steins;Gate",
			"metadata": "The self-proclaimed mad scientist Rintarou Okabe rents out a room in a rickety old building in Akihabara, where he indulges himself in his hobby of inventing prospective ‘future gadgets’ with fellow lab members: Mayuri Shiina, his air-headed childhood friend, and Hashida Itaru, a perverted hacker nicknamed ‘Daru.’ The three pass the time by tinkering with their most promising contraption yet, a machine dubbed the ‘Phone Microwave,’ which performs the strange function of morphing bananas into piles of green gel. Though miraculous in itself, the phenomenon doesn't provide anything concrete in Okabe's search for a scientific breakthrough; that is, until the lab members are spurred into action by a string of mysterious happenings before stumbling upon an unexpected success—the Phone Microwave can send emails to the past, altering the flow of history.",
			"locations": [
				{
					"folder": "Fortran",
					"file1": "Makise_Kurisu_Modern_Fortran_Explained.png"
				}
			]
		},

		{
			"series_name": "Sword Art Online",
			"metadata": "In the year 2022, virtual reality has progressed by leaps and bounds, and a massive online role-playing game called Sword Art Online (SAO) is launched. With the aid of ‘NerveGear’ technology, players can control their avatars within the game using nothing but their own thoughts. Kazuto Kirigaya, nicknamed ‘Kirito,’ is among the lucky few enthusiasts who get their hands on the first shipment of the game. He logs in to find himself, with ten-thousand others, in the scenic and elaborate world of Aincrad, one full of fantastic medieval weapons and gruesome monsters. However, in a cruel turn of events, the players soon realize they cannot log out; the game's creator has trapped them in his new world until they complete all one hundred levels of the game.",
			"locations": [
				{
					"folder": "Lua",
					"file1": "Konno_Yukki_Programming_In_Lua.png"
				}
			]
		},

		{
			"series_name": "Sword Gai",
			"metadata": "Gai is a young man who became an apprentice under a blacksmith named Amon, who found him as newborn holding on to a legendary cursed katana called ‘Shiryū’ that drove his mother into committing suicide rather than let its bloodlust to consume her. The katana is revealed to be one of many cursed weapons that turn the user into a thrall to embody their murderous impulses, the Chrystalis gradually losing their humanity while becoming armored monsters called Busoma. After Gai lost his right arm when a ceremony to quell Shiryū goes array, Amon forged the sword into a prosthetic limb for Gai. Becoming a chrysalis with the ability to fuse with his weapon, Gai clings on to his humanity while facing a Busoma seeking to exterminate humanity.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Naoki_Miki_reading_SICP.png"
				}
			]
		},

		{
			"series_name": "Takunomi",
			"metadata": "20-year-old Michiru arrives in Tokyo where she will start a new job and big-city lifestyle, moving into Stella House Haruno, a women-only share house. The three other young women there - Kae, Makoto and Nao - welcome her warmly, and as they live their lives they experience a variety of Japanese alcoholic drinks, one featured per episode.",
			"locations": [
				{
					"folder": "Editors",
					"file1": "Takunomi_Nao-Kiriyama_Vi.png"
				},
				{
					"folder": "V",
					"file1": "Takunomi_Nao-Kiriyama_V.png"
				}
			]
		},

		{
			"series_name": "The Aquatope on White Sand",
			"metadata": "Set in Nanjō, Okinawa, The Aquatope on White Sand tells the story of two girls; Kukuru Misakino, who is chasing her dream by working at an aquarium, and Fūka Miyazawa, an idol from Tokyo who has given up her position and journeyed to Okinawa in search of something new.",
			"locations": [
				{
					"folder": "Delphi",
					"file1": "Kukuru_little_book_of_delphi.png"
				}
			]
		},

		{
			"series_name": "The Disastrous Life of Saiki K.",
			"metadata": "To the average person, psychic abilities might seem a blessing; for Kusuo Saiki, however, this couldn't be further from the truth. Gifted with a wide assortment of supernatural abilities ranging from telepathy to x-ray vision, he finds this so-called blessing to be nothing but a curse. As all the inconveniences his powers cause constantly pile up, all Kusuo aims for is an ordinary, hassle-free life—a life where ignorance is bliss. Unfortunately, the life of a psychic is far from quiet. Though Kusuo tries to stay out of the spotlight by keeping his powers a secret from his classmates, he ends up inadvertently attracting the attention of many odd characters, such as the empty-headed Riki Nendou and the delusional Shun Kaidou. Forced to deal with the craziness of the people around him, Kusuo comes to learn that the ordinary life he has been striving for is a lot more difficult to achieve than expected.",
			"locations": [
				{
					"folder": "Typescript",
					"file1": "Teruhashi_Kokomi_Reading_Essential_Typescript_In_The_Bathroom.png"
				}
			]
		},

		{
			"series_name": "The Great Jahy Will Not Be Defeated!",
			"metadata": "Jahy, the feared and respected number-two ruler of the Dark Realm, suddenly finds herself powerless and shrunken in the human world after a magical girl destroys a powerful mana crystal, which also destroys her home realm. The manga follows Jahy and her daily life as she learns to live in her new surroundings while she works to restore her original form, the mana crystal, and the Dark Realm.",
			"locations": [
				{
					"folder": "Python",
					"file1": "Jahy_Sama_Python.jpg"
				}
			]
		},

		{
			"series_name": "The Helpful Fox Senko-San",
			"metadata": "Kuroto Nakano is a young salaryman with a very unhappy and stressful life, almost entirely occupied by his job at the company for which he works. One night, after yet another day spent overworking, the moment he opens the door of his home he finds a seemingly young girl with fox ears and a tail cooking dinner for him – her name is Senko, an 800-year-old fox demigod. Senko has been sent to Earth from the spirit world to relieve Kuroto from his unhappy life and help him find happiness again.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Senko_Holds_Structure_and_Interpretations_of_Computer_Programs.jpg"
				},
				{
					"folder": "Scala",
					"file1": "Senko-san_Scala.png"
				}
			]
		},

		{
			"series_name": "The Melancholy of Haruhi Suzumiya",
			"metadata": "Kyon, your typical high school student, has long given up his belief in the supernatural. However, upon meeting Haruhi Suzumiya, he quickly finds out that it is the supernatural that she is interested in—aliens, time travelers, and espers among other things. When Haruhi laments about the lack of intriguing clubs around school, Kyon inspires Haruhi to form her own club. As a result, the SOS Brigade is formed, a club which specializes in all that is the supernatural.",
			"locations": [
				{
					"folder": "C",
					"file1": "Nagato_Yuki_Backflip_With_C_Programming_Language.png",
					"file2": "Nagato_Yuki_Reading_The_C_Programming_Language_In_The_Library.png",
					"file3": "Yuki_Nagato_Wakeboarding_Reading_C_Programming_Language.jpg"
				},
				{
					"folder": "Design Patterns",
					"file1": "Nagato_Yuki_Design_Patterns.png"
				},
				{
					"folder": "HoTT",
					"file1": "Nagato_Yuki_Reads_HoTT.png"
				},
				{
					"folder": "Racket",
					"file1": "Nagato_Yuki_HtDP.png"
				},
				{
					"folder": "SICP",
					"file1": "Nagato_Yuki_Bandaged_Hand_SICP.jpg",
					"file2": "Nagato_Yuki_On_Cover_Of_SICP.jpg",
					"file3": "Nagato_Yuki_SICP.jpg"
				},
				{
					"folder": "Uncategorized",
					"file1": "Nagato_Yuki_Reading_Starplex.jpg"
				}
			]
		},

		{
			"series_name": "The Quintessential Quintuplets",
			"metadata": "Fuutarou Uesugi is an ace high school student, but leads an otherwise tough life. His standoffish personality and reclusive nature have left him friendless, and his father is debt-ridden, forcing his family to scrape by. One day during his lunch break, Uesugi argues with a female transfer student who has claimed ‘his seat,’ leading both of them to dislike each other. That same day, he is presented with a golden opportunity to clear his family's debt: a private tutoring gig for a wealthy family's daughter, with a wage of five times the market price. He accepts the proposal, but is horrified to discover that the client, Itsuki Nakano, is the girl he confronted earlier!",
			"locations": [
				{
					"folder": "Swift",
					"file1": "Toubun-No-Hanayome_Nino-Nakano_Swift.png"
				}
			]
		},

		{
			"series_name": "The Saint’s Magic Power Is Omnipotent",
			"metadata": "Sei Takanashi, an office worker, returns home late at night and is then summoned to the magic world of Salutania. Unfazed, Sei follows her own devices and sets her sights on being a researcher at the Medicinal Flora Research Institute, an establishment known for its studies regarding herbs and potions. While indulging in her latest passion, Sei has a fateful encounter with the commander of the Third Order of Knights. But little does she know, her aptitude as a Saint will continue to exert its influence over her new life.",
			"locations": [
				{
					"folder": "Kotlin",
					"file1": "Takanashi_Sei_Holding_Kotlin_In_Action.png"
				}
			]
		},

		{
			"series_name": "The World God Only Knows",
			"metadata": "Keima Katsuragi, known online as the legendary ‘God of Conquest,’ can conquer any girl's heart—in dating sim games, at least. In reality, he opts for the two-dimensional world of gaming over real life because he is an unhealthily obsessed otaku of galge games (a type of Japanese video game centered on interactions with attractive girls). When he arrogantly accepts an anonymous offer to prove his supremacy at dating sim games, Keima is misled into aiding a naïve and impish demon from hell named Elucia ‘Elsie’ de Lute Ima with her mission: retrieving runaway evil spirits who have escaped from hell and scattered themselves throughout the human world. Keima discovers that the only way to capture these spirits is to conquer what he hates the most: the unpredictable hearts of three-dimensional girls! Shackled to Elsie via a deadly collar, Keima now has his title of ‘God of Conquest’ put to the ultimate test as he is forced to navigate through the hearts of a multitude of real-life girls.",
			"locations": [
				{
					"folder": "Ada",
					"file1": "Shiomiya_Shiori_Holding_Shy_Ada_95_From_The_Beginning.png"
				},
				{
					"folder": "C",
					"file1": "Shiomiya_Shiori_Holding_Shy_C_Programming_language_wp.png"
				},
				{
					"folder": "Lisp",
					"file1": "Urara_Shiratori_holding_ANSI_Common_Lisp.png"
				},
				{
					"folder": "Quantum Computing",
					"file1": "Urara_Shiratori_Intro_Topological_Quantun_Computation.png"
				},
				{
					"folder": "SICP",
					"file1": "Shiori_Shiomiya_Holding_SICP.jpg",
					"file2": "Urara_Shiratori_SICP.png"
				}
			]
		},

		{
			"series_name": "The iDOLM@ASTER",
			"metadata": "The central aspect of the plot for The Idolmaster deals with the training of prospective pop idols on their way to stardom. The main talent agency featured in the series is 765 Production (765 Pro), a rising studio located in a small office.",
			"locations": [
				{
					"folder": "ASM",
					"file1": "iM@S_Shijo_Takane_holding_Assembly_Language_for_x86_Processors.png"
				},
				{
					"folder": "C",
					"file1": "IM@S_Minase_Iori_Holding_Chest_C_Programming_Language.png"
				},
				{
					"folder": "Lua",
					"file1": "Idolmaster_Million_Live_Yuriko_Nanao_Holding_Programming_in_Lua_by_Roberto_Ierusalimschy.png"
				},
				{
					"folder": "Prolog",
					"file1": "iM@S_Hoshii_Miki_Art_of_Prolog.png"
				},
				{
					"folder": "Ruby",
					"file1": "Idolmaster_Cinderella_Girls_Chieri_Holding_Ruby_on_Rails_Tutorial_by_Michael_Hartl.png",
					"file2": "Kanzaki_Ranko_Holding_Ruby_Programming_Lang.png"
				},
				{
					"folder": "SICP",
					"file1": "IM@s_Ganaha_Hibiki_SICP.png",
					"file2": "IM@s_Kisaragi_Chihaya_SICP.png",
					"file3": "Kikuchi_Makoto_Hiding_Behind_SICP.jpg",
					"file4": "Niko_Yazawa_SICP.jpg",
					"file5": "Yuriko_Nanao_SICP.png"
				}
			]
		},

		{
			"series_name": "The “Hentai” Prince and the Stony Cat",
			"metadata": "Youto Yokodera wants to be seen in a way different from most men: as a pervert. However, his lewd actions are often misinterpreted as good intentions, and people cannot see his true nature. Upon hearing rumors of a cat statue that can banish an unwanted trait, he searches for it and prays for his façade to be removed. But each wish comes at a price: those unwelcomed traits are transferred to someone else who desires them!",
			"locations": [
				{
					"folder": "C",
					"file1": "Tsukukakushi_Tsukiko_Holding_C_Programming_Language.png"
				}
			]
		},

		{
			"series_name": "Toradora!",
			"metadata": "Ryuuji Takasu is a gentle high school student with a love for housework; but in contrast to his kind nature, he has an intimidating face that often gets him labeled as a delinquent. On the other hand is Taiga Aisaka, a small, doll-like student, who is anything but a cute and fragile girl. Equipped with a wooden katana and feisty personality, Taiga is known throughout the school as the ‘Palmtop Tiger.’ Toradora! is a romantic comedy that follows this odd duo as they embark on a quest to help each other with their respective crushes, forming an unlikely alliance in the process.",
			"locations": [
				{
					"folder": "Other",
					"file1": "Kushieda_Minori_Twitter_Fail_Whale_Mug.png"
				}
			]
		},

		{
			"series_name": "Touhou Project",
			"metadata": "The Touhou Project is a series of 2D vertically-scrolling danmaku shooting games made by Team Shanghai Alice, with six fighting game spinoffs co-produced with Twilight Frontier.",
			"locations": [
				{
					"folder": "C++",
					"file1": "Cirno_teaches_c++.jpg"
				},
				{
					"folder": "C",
					"file1": "Hakurei_Reimu_Holding_C_Programming_Language.jpg"
				},
				{
					"folder": "Math",
					"file1": "Fumo_Hinanawi_Tenshi_reading_Discrete_Math.jpg",
					"file2": "Youmu_Konpaku_Holding_Discrete_Math_And_Its_Applications.jpg"
				},
				{
					"folder": "Memes",
					"file1": "Cirno_Kirisame_Marisa_Learning_Programming_CPP.png",
					"file2": "Komeiji_Satori_SICP.jpg"
				},
				{
					"folder": "SICP",
					"file1": "Fujiwara_No_Mokou_Law_Is_SICP.png",
					"file2": "Fujiwara_No_Mokou_Lewds_SICP.jpg",
					"file3": "Komeji_Satori_Owns_SICP.png",
					"file4": "Patchouli_Gives_SICP.jpg",
					"file5": "Patchouli_Looking_At_Viewer_SICP.jpg",
					"file6": "Patchouli_Prefers_SICP.jpg",
					"file7": "Patchouli_SICP.jpg",
					"file8": "Patchy_Fumo_reads_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Vandread!",
			"metadata": "In Vandread, men are from Mars and women are from Venus! Well, not quite. Technology has allowed mankind to colonize the entire Milky Way galaxy, and in one star system, the men and women live on two different planets, Taraak and Mejere. A bitter and very literal gender war rages, to the point where they don't even see each other as the same species anymore! Hibiki Tokai, a male third-class laborer from Taraak, ends up stuck on a battleship after a botched attempt at stealing a robot. When female pirates capture the Taraakian Vanguard, things don't look like they could get any worse for Hibiki. Unfortunately, they do; when the male crew of the Vanguard fire on their captured vessel out of desperation, they create a giant wormhole, which sucks the Vanguard and the Mejeran pirate's ships into itself! Now, stuck far away from their home planets, these men and women must learn to work together if they ever wish to make it back home.",
			"locations": [
				{
					"folder": "Verilog",
					"file1": "Dita_Verilog_HDL.png"
				}
			]
		},

		{
			"series_name": "Virtual YouTubers",
			"metadata": "A VTuber, or virtual YouTuber, is an online entertainer who uses a virtual avatar generated using computer graphics and real-time motion capture software or technology.",
			"locations": [
				{
					"folder": "Javascript",
					"file1": "Ninomae_Ina'nis_Holding_Eloquent_Javascript.jpg"
				},
				{
					"folder": "Rust",
					"file1": "Ninomae_Inanis_Holding_Rust_Programming.png"
				},
				{
					"folder": "SICP",
					"file1": "Ninomae_Inanis_Holding_SICP.jpg"
				}
			]
		},

		{
			"series_name": "Wakaba Girl",
			"metadata": "Wakaba Kohashi is a ‘a slightly out-of-tune super’ daughter of a well-to-do family. She looks like an elegant rich daughter, but admires the trendy 'gyaru' fashion subculture. Her friends are the pure, innocent, fairy-tale-like Moeko, the capricious Mao, and Nao who used to be an athletic type of girl, but now loves the boys-love genre. Most of the series takes place at Shirozume Girls High School.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Kohashi_Wakaba_READING_SICP.jpg",
					"file2": "Kohashi_Wakaba_reading_SICP2.jpg"
				}
			]
		},

		{
			"series_name": "Wise Man’s Grandchild",
			"metadata": "A young salaryman who died in an accident was reborn in another world filled with magic and demons. As a baby, he was picked up by the patriot hero ‘Sage’ Merlin Wolford and was given the name Shin. He was raised as a grandson and soaked up Merlin's teachings, earning him some irresistible powers. However, when Shin became 15, Merlin realized, ‘I forgot to teach him common sense!’ Diseum, king of the Earlshide Kingdom, recommends Shin to attend his Magic Academy, on the agreement of not using Shin for political warfare. In the capital, Shin rescues two girls, Maria and Sizilien, from thugs, and later he would inaugurate a club that consists of him and others.",
			"locations": [
				{
					"folder": "Perl",
					"file1": "Kenja-No-Mago_Examiner_Perl.png",
					"file2": "Kenja-No-Mago_Examiner_Perl2.png"
				}
			]
		},

		{
			"series_name": "Your Name",
			"metadata": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture. One day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.",
			"locations": [
				{
					"folder": "OCami",
					"file1": "Iino_Miko_from_Kaguya-sama_Holding_OCaml_Book.jpg"
				},
				{
					"folder": "Rust",
					"file1": "Miyamizu_Mitsuha_On_Ownership_And_Borrowing.jpg"
				}
			]
		},

		{
			"series_name": "YuruYuri",
			"metadata": "After a year in grade school without her childhood friends, first year student Akari Akaza is finally reunited with second years Yui Funami and Kyouko Toshinou at their all-girls' middle school. During the duo's first year, Yui and Kyouko formed the ‘Amusement Club’ which occupies the now nonexistent Tea Club's room. Shortly after Akari joins, one of her fellow classmates, Chinatsu Yoshikawa, pays the trio a visit under the impression that they are the Tea Club; it is only once the three girls explain that the Tea Club has been disbanded that they can convince Chinatsu to join the Amusement Club—a group with no purpose other than to provide entertainment for its members.",
			"locations": [
				{
					"folder": "SICP",
					"file1": "Fumami_Yui_Holding_SICP.png",
					"file2": "Funami_Yui_Hugging_SICP.jpg",
					"file3": "Sakurako_Ohmuro_Holding_SICP.png"
				}
			]
		}



	]
}
